# Выведите количество слов в строке, не используя метод split()

a = input()
b = a.count(' ') + 1
print(b)
