# Создайте список-матрешку в который поместите два элемента:
# целое число и вложенный список, в который поместите еще два элемента:
# вещественное число и вложенный список, в который поместите еще два элемента:
# комплексное число и вложенный список, в который поместите еще три элемента:
# пустой список целое число и строку "Иголка".

a = [12, [2.4, [2+4j, [], 24, "Иголка"]]]
print(a)
