# Выведите количество слов в строке

a = input()
b = len(a.split())
print(b)
